tests/fixtures/xml/fake_envConsulta.xml

<soapenv:Envelope xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/" xmlns:sped = "http://sped.fazenda.gov.br/" ><soapenv:Header/><soapenv:Body><sped:ConsultaInformacoesConsolidadas><sped:tipoInscricaoContribuinte>1</sped:tipoInscricaoContribuinte><sped:numeroInscricaoContribuinte>99999999</sped:numeroInscricaoContribuinte><sped:numeroProtocoloFechamento>1.2.201707.0000000000000007638</sped:numeroProtocoloFechamento></sped:ConsultaInformacoesConsolidadas></soapenv:Body></soapenv:Envelope>